package cn.com.szgao.action;

import java.util.HashMap;
import java.util.Map;


public class ReadTxt {
    //姓氏
	private static String SURNAMES="徐,缪,楼,阴,幸,练,释,朱,司,苟,涂,买,华,拜,摆,兰,肖,旷,曲,黎,覃,付,丘,谌,锦,兴,叶,俞,赵,钱,孙,李,周,吴,郑,王,冯,陈,褚,卫,蒋,沈,韩,杨,朱,秦,尤,许,何,吕,施,张,孔,曹,严,华,"+
			                    "金,魏,陶,姜,戚,谢,邹,喻,柏,水,窦,章,云,苏,潘,葛,奚,范,彭,郎,鲁,韦,昌,马,苗,凤,花,方,钟,迟,"+
			                    "俞,任,袁,柳,酆,鲍,史,唐,费,廉,岑,薛,雷,贺,倪,汤,滕,殷,罗,毕,郝,邬,安,常,乐,于,时,傅,"+
								"皮,卞,齐,康,伍,余,元,卜,顾,孟,平,黄,和,穆,萧,尹,姚,邵,湛,汪,祁,毛,禹,狄,米,贝,明,臧,"+
								"计,伏,成,戴,谈,宋,茅,庞,熊,纪,舒,屈,项,祝,董,梁,杜,阮,蓝,闵,席,季,麻,强,贾,路,娄,危,"+
								"江,童,颜,郭,梅,盛,林,刁,锺,徐,邱,骆,高,夏,蔡,田,樊,胡,凌,霍,虞,万,支,柯,昝,管,卢,莫,"+
								"房,裘,干,解,应,宗,丁,宣,贲,邓,郁,单,杭,洪,包,诸,左,石,崔,吉,钮,龚,程,嵇,邢,滑,裴,"+
								"陆,荣,翁,荀,羊,於,惠,甄,麴,家,封,芮,羿,储,靳,汲,邴,糜,松,井,段,富,巫,乌,焦,巴,弓,牧,"+
								"隗,山,谷,车,侯,宓,蓬,全,郗,班,仰,秋,仲,伊,宫,宁,仇,栾,暴,甘,钭,历,戎,祖,武,符,刘,景,"+
								"詹,束,龙,印,宿,白,怀,蒲,邰,从,鄂,索,咸,籍,赖,卓,蔺,屠,蒙,池,乔,阳,郁,胥,能,苍,双,闻,"+
								"莘,党,翟,谭,贡,劳,逄,姬,申,扶,堵,冉,宰,郦,雍,却,璩,桑,桂,濮,牛,寿,边,扈,燕,冀,僪,冶,"+
								"浦,尚,农,温,别,庄,晏,柴,瞿,阎,充,慕,连,茹,习,宦,艾,鱼,容,向,古,易,慎,戈,廖,庾,终,暨,"+
								"居,衡,步,都,耿,满,弘,匡,国,文,寇,广,禄,阙,东,欧,殳,沃,利,蔚,越,夔,隆,师,巩,厍,聂,晁,"+
								"勾,敖,融,冷,訾,辛,阚,那,简,饶,空,曾,毋,沙,乜,鞠,须,丰,巢,关,蒯,相,查,后,荆,红,游,竺,"+
								"权,逮,盍,益,桓,公,万俟,司马,上官,欧阳,夏侯,诸葛,闻人,东方,东皇,赫连,皇甫,尉迟,公羊,澹台,"+
								"公冶,宗政,濮阳,淳于,单于,太叔,申屠,公孙,仲孙,轩辕,令狐,钟离,宇文,长孙,慕容,司徒,司空,尉,"+
								"召,南宫,赏,伯,佴,佘,牟,商,西门,东门,左丘,梁丘,琴,公良,段干,开,光,丑,那拉,叶赫那拉,星,子车,"+
								"瑞,眭,泥,运,摩,伟,铁,迮,刑,秘,鲜,寒";
	private static String COMPANYS="公司,厅,机构,部,委员会,局,总署,银行,集团,店,酒楼,酒家,馆,餐厅,府,厅,社,学,事务所,厂,会,队,分行,支行,商行,办事处,行,场,中心,院,组,古寺,学";
	public static  String[] PLDEF={"原告","被告","被上诉人","上诉人","被申诉人","申诉人","被执行人","执行人","原审原告","原审被告"};
    public static  String[] PLAINTIFF={"第三人","诉讼代理人","辩护人","上诉人","申诉人","申请执行人","申请人","执行人","原审被告","赔偿请求人","原公诉机关","公诉机关","执行机构","原告","复议机关","申请复议人","一审原告","委托代理人","法定代表人","起诉人","移送执行机构","二审上诉人","原审第三人","负责人","抗诉机关","申请再审人","委托代理","四被上诉人委托代理人","两上诉人的委托代理人"};
    public static  String[] PLAINTIFF2={"原告"};
    public static  String[] DEFENDANT={"被上诉人","被执行人","被申诉人","被申请人","被申请执行人","原审被告人","原审原告","罪犯","被告","赔偿义务机关","一审被告","二审被上诉人"};
    public static  String[] DELFEIN={"委托代理人","法定代表人","赔偿请求人"};
    public static  String[] REPACLE={"上诉人","申诉人","申请执行人","执行人"};
    public static  String[] REPACLE2={"被告","原告"};
    public static  String[] KEYHEAVY={"被上诉人","被执行人","被申诉人","被申请人","被申请执行人"};
    public static  String[] KEYWORDKE={"申请再审人","被上诉人","二审被上诉人","原审被告人","原审第三人","二审上诉人","一审被告","一审原告","被申请人","赔偿请求人","被告人","原告","执行机构","被申请人","申请执行人","申请人","辩护人","被申请执行人","赔偿请求人","赔偿义务机关","原公诉机关","抗诉机关","公诉机关","复议机关","委托代理人","委托代理","特别授权代理","四被上诉人委托代理人","两上诉人的委托代理人","移送执行机构","诉讼代理人","法定代表人","申请复议人","被上诉人","被申诉人","被执行人","反诉被告","反诉原告","原审被告","原审原告","执行人","负责人","上诉人","起诉人","申诉人","被告人","原告人","被告","原告","罪犯","第三人"}; 
    public static  String[] KEYWORDKE2={"被申请人","申请人","被申请执行人","赔偿请求人","赔偿义务机关","公诉机关","复议机关","申请执行人","申请复议人","被上诉人","被申诉人","被执行人","原审被告","原审原告","执行人","上诉人","申诉人","被告","原告","罪犯"}; 
	public static  String[] CAUSE={"驳回申诉通知","赔偿决定书","争议一案","纠纷一案","通告一案","违法一案","执行一案","赔偿一案","劫罪一案","确认一案","危险驾驶","诈骗","盗窃","死亡","强奸","聚众斗殴","寻衅滋事","贩卖毒品","运输毒品","故意伤害","涉嫌诽谤","抢劫","绑架","勒索","杀人","纠纷","非法拘禁","运输毒品","破坏电力设备","一案","违法","非法","犯罪"};
    public static  String[] THEVERDICT={"裁定如下","决定如下","判决如下","协议如下","调解协议","如下协议","决定"};
    public static  String[] BOOKCLASS={"委员会","院"};
    public static  String[] THECOURT ={"国","省","市","法院","院"};
    public static  String[] DATESTATUS={"提交时间","提交日期","发布时间","发布日期","编辑时间","编辑日期","发表时间","录入时间","更新时间","点击率","点击数","发表于","阅读","点击","日期","作者","时间","今天是","小"};
    public static  String[] PARENTHESES={"（","[","\\(","）","(","书"};
    public static  String[] CODING={"UTF-8","gb2312","gbk"};
    public static  String[] ERCOEDING={"�","й","෨","Ժ"};
    public static  String[] PARENTH={"（","("};
    public static Map<String,String> MAP=new HashMap<String,String>();
	static{
		MAP.put("（", "）");
		MAP.put("(", ")");
	} 
    //待过滤的关键字
    public static  String[] REPACLEALLKEY={"被","申","原审","反诉","一审"};
	/**
	 * @param args
	 */
	public static void main(String[] args) {
				

	}

	public static String[] getDataSurNames(){	
		return SURNAMES.split(",");
	}
	public static String[] getDataCompanys(){
		return COMPANYS.split(",");
	}
}
